Repository: xcv58/MacTools
Catalog: Plugins/SavedScripts/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# settings.safety.description
source: 脚本以当前用户权限运行。MacTools 不使用 sudo，也不会把脚本文本拼接到 Shell 命令中。输出仅保留到本次退出。备份和 Run Link 需要逐个脚本启用。
ar: تعمل البرامج النصية بصلاحيات المستخدم الخاصة بك. لا يستخدم MacTools الأمر sudo ولا يدرج مصدر البرنامج النصي داخل أوامر shell. تستمر المخرجات حتى نهاية جلسة التطبيق فقط. يتم تمكين النسخ الاحتياطية وRun Links لكل برنامج نصي.
de: Skripte werden mit deinen Benutzerrechten ausgeführt. MacTools verwendet kein sudo und fügt Skripttext nicht in Shell-Befehle ein. Die Ausgabe bleibt nur bis zum Ende dieser App-Sitzung erhalten. Backups und Run Links werden pro Skript aktiviert.
en: Scripts run with your user permissions. MacTools does not use sudo or interpolate script source into shell commands. Output lasts only until this app session ends. Backups and Run Links are enabled per script.
es: Los scripts se ejecutan con tus permisos de usuario. MacTools no usa sudo ni inserta el código del script en comandos de shell. La salida solo dura hasta que termina esta sesión de la app. Las copias y los Run Links se activan por script.
fr: Les scripts s’exécutent avec vos autorisations utilisateur. MacTools n’utilise pas sudo et n’insère pas le code du script dans les commandes shell. La sortie ne dure que jusqu’à la fin de cette session. Les sauvegardes et Run Links s’activent par script.
ja: スクリプトはユーザ権限で実行されます。MacTools は sudo を使用せず、スクリプト本文をシェルコマンドに埋め込みません。出力はこのアプリセッションの終了までのみ保持されます。バックアップと Run Link はスクリプトごとに有効にします。
ko: 스크립트는 사용자 권한으로 실행됩니다. MacTools는 sudo를 사용하거나 스크립트 소스를 셸 명령에 삽입하지 않습니다. 출력은 이 앱 세션이 끝날 때까지만 유지됩니다. 백업과 Run Link는 스크립트별로 활성화합니다.
pt: Os scripts são executados com suas permissões de usuário. O MacTools não usa sudo nem insere o código do script em comandos de shell. A saída dura apenas até o fim desta sessão do app. Backups e Run Links são ativados por script.
ru: Скрипты выполняются с вашими правами пользователя. MacTools не использует sudo и не вставляет исходный код в команды shell. Вывод хранится только до конца сеанса приложения. Резервное копирование и Run Links включаются для каждого скрипта.
tr: Betikler kullanıcı izinlerinizle çalışır. MacTools sudo kullanmaz ve betik kaynağını Shell komutlarına yerleştirmez. Çıktı yalnızca uygulama oturumu bitene kadar kalır. Yedekleme ve Run Link'ler betik başına etkinleştirilir.
zh_hant: 腳本以目前使用者權限執行。MacTools 不使用 sudo，也不會將腳本文字拼接到 Shell 指令中。輸出只保留到本次結束。備份和 Run Link 需逐一為腳本啟用。

# settings.safety.title
source: 安全与共享
ar: الأمان والمشاركة
de: Sicherheit & Freigabe
en: Safety & Sharing
es: Seguridad y uso compartido
fr: Sécurité et partage
ja: 安全性と共有
ko: 안전 및 공유
pt: Segurança e compartilhamento
ru: Безопасность и общий доступ
tr: Güvenlik ve Paylaşım
zh_hant: 安全與共享

# settings.search.placeholder
source: 搜索脚本
ar: البحث في البرامج النصية
de: Skripte suchen
en: Search Scripts
es: Buscar scripts
fr: Rechercher des scripts
ja: スクリプトを検索
ko: 스크립트 검색
pt: Buscar scripts
ru: Поиск скриптов
tr: Betik Ara
zh_hant: 搜尋腳本

# validation.directoryTooLong
source: 工作目录路径过长。
ar: مسار مجلد العمل طويل جدًا.
de: Der Pfad des Arbeitsordners ist zu lang.
en: The working directory path is too long.
es: La ruta de la carpeta de trabajo es demasiado larga.
fr: Le chemin du dossier de travail est trop long.
ja: 作業フォルダのパスが長すぎます。
ko: 작업 폴더 경로가 너무 깁니다.
pt: O caminho da pasta de trabalho é muito longo.
ru: Путь к рабочей папке слишком длинный.
tr: Çalışma dizini yolu çok uzun.
zh_hant: 工作目錄路徑過長。

# validation.duplicateID
source: 脚本标识符已被使用。
ar: معرّف البرنامج النصي مستخدم بالفعل.
de: Die Skriptkennung wird bereits verwendet.
en: The script identifier is already in use.
es: El identificador del script ya está en uso.
fr: L’identifiant du script est déjà utilisé.
ja: スクリプト識別子はすでに使用されています。
ko: 스크립트 식별자가 이미 사용 중입니다.
pt: O identificador do script já está em uso.
ru: Идентификатор скрипта уже используется.
tr: Betik tanımlayıcısı zaten kullanımda.
zh_hant: 腳本識別碼已被使用。

# validation.emptyName
source: 请输入脚本名称。
ar: أدخل اسمًا للبرنامج النصي.
de: Gib einen Skriptnamen ein.
en: Enter a script name.
es: Introduce un nombre para el script.
fr: Saisissez un nom de script.
ja: スクリプト名を入力してください。
ko: 스크립트 이름을 입력하세요.
pt: Digite um nome para o script.
ru: Введите имя скрипта.
tr: Bir betik adı girin.
zh_hant: 請輸入腳本名稱。

# validation.emptySource
source: 请输入脚本文本。
ar: أدخل مصدر البرنامج النصي.
de: Gib den Skripttext ein.
en: Enter script source.
es: Introduce el código del script.
fr: Saisissez le code du script.
ja: スクリプト本文を入力してください。
ko: 스크립트 소스를 입력하세요.
pt: Digite o código do script.
ru: Введите исходный код скрипта.
tr: Betik kaynağını girin.
zh_hant: 請輸入腳本文字。

# validation.nameTooLong
source: 脚本名称过长。
ar: اسم البرنامج النصي طويل جدًا.
de: Der Skriptname ist zu lang.
en: The script name is too long.
es: El nombre del script es demasiado largo.
fr: Le nom du script est trop long.
ja: スクリプト名が長すぎます。
ko: 스크립트 이름이 너무 깁니다.
pt: O nome do script é muito longo.
ru: Имя скрипта слишком длинное.
tr: Betik adı çok uzun.
zh_hant: 腳本名稱過長。

# validation.payloadTooLarge
source: 脚本库数据过大。
ar: مكتبة البرامج النصية كبيرة جدًا.
de: Die Skriptbibliothek ist zu groß.
en: The script library is too large.
es: La biblioteca de scripts es demasiado grande.
fr: La bibliothèque de scripts est trop volumineuse.
ja: スクリプトライブラリが大きすぎます。
ko: 스크립트 보관함이 너무 큽니다.
pt: A biblioteca de scripts é muito grande.
ru: Библиотека скриптов слишком велика.
tr: Betik kitaplığı çok büyük.
zh_hant: 腳本庫資料過大。

# validation.sourceTooLong
source: 脚本文本超过 64 KB。
ar: يتجاوز مصدر البرنامج النصي 64 كيلوبايت.
de: Der Skripttext überschreitet 64 KB.
en: The script source exceeds 64 KB.
es: El código del script supera los 64 KB.
fr: Le code du script dépasse 64 Ko.
ja: スクリプト本文が 64 KB を超えています。
ko: 스크립트 소스가 64KB를 초과합니다.
pt: O código do script excede 64 KB.
ru: Исходный код скрипта превышает 64 КБ.
tr: Betik kaynağı 64 KB'yi aşıyor.
zh_hant: 腳本文字超過 64 KB。

# validation.timeout
source: 超时必须在 1 到 300 秒之间。
ar: يجب أن تتراوح المهلة بين ثانية واحدة و300 ثانية.
de: Das Zeitlimit muss zwischen 1 und 300 Sekunden liegen.
en: The timeout must be between 1 and 300 seconds.
es: El tiempo límite debe estar entre 1 y 300 segundos.
fr: Le délai doit être compris entre 1 et 300 secondes.
ja: タイムアウトは 1〜300 秒にしてください。
ko: 시간 제한은 1초에서 300초 사이여야 합니다.
pt: O tempo limite deve estar entre 1 e 300 segundos.
ru: Тайм-аут должен быть от 1 до 300 секунд.
tr: Zaman aşımı 1 ile 300 saniye arasında olmalıdır.
zh_hant: 逾時必須介於 1 到 300 秒之間。

# validation.tooMany
source: 最多可以保存 32 个脚本。
ar: يمكنك حفظ ما يصل إلى 32 برنامجًا نصيًا.
de: Du kannst bis zu 32 Skripte sichern.
en: You can save up to 32 scripts.
es: Puedes guardar hasta 32 scripts.
fr: Vous pouvez enregistrer jusqu’à 32 scripts.
ja: 最大 32 個のスクリプトを保存できます。
ko: 스크립트는 최대 32개까지 저장할 수 있습니다.
pt: Você pode salvar até 32 scripts.
ru: Можно сохранить до 32 скриптов.
tr: En fazla 32 betik kaydedebilirsiniz.
zh_hant: 最多可以儲存 32 個腳本。

# validation.persistenceFailed
source: 无法保存脚本库。
ar: تعذر حفظ مكتبة البرامج النصية.
de: Die Skriptbibliothek konnte nicht gesichert werden.
en: Unable to save the script library.
es: No se pudo guardar la biblioteca de scripts.
fr: Impossible d’enregistrer la bibliothèque de scripts.
ja: スクリプトライブラリを保存できません。
ko: 스크립트 보관함을 저장할 수 없습니다.
pt: Não foi possível salvar a biblioteca de scripts.
ru: Не удалось сохранить библиотеку скриптов.
tr: Betik kitaplığı kaydedilemedi.
zh_hant: 無法儲存指令碼庫。

# validation.recoveryRequired
source: 无法读取脚本库；请先导入备份恢复。
ar: تعذرت قراءة مكتبة البرامج النصية؛ استورد نسخة احتياطية لاستعادتها.
de: Die Skriptbibliothek kann nicht gelesen werden; importiere zur Wiederherstellung ein Backup.
en: The script library cannot be read; import a backup to recover it.
es: No se puede leer la biblioteca de scripts; importa una copia para recuperarla.
fr: La bibliothèque de scripts est illisible ; importez une sauvegarde pour la récupérer.
ja: スクリプトライブラリを読み込めません。バックアップを読み込んで復元してください。
ko: 스크립트 보관함을 읽을 수 없습니다. 백업을 가져와 복구하십시오.
pt: A biblioteca de scripts não pode ser lida; importe um backup para recuperá-la.
ru: Библиотека скриптов не читается; импортируйте резервную копию для восстановления.
tr: Betik kitaplığı okunamıyor; kurtarmak için bir yedeği içe aktarın.
zh_hant: 無法讀取指令碼庫；請先匯入備份以回復。

# editor.confirm.description
source: 关闭后，从操作网格、触控板手势、快捷键和工作流运行时会立即执行。
ar: عند إيقافه، يُشغّل البرنامج النصي فورًا من شبكة الإجراءات وإيماءات لوحة التعقب والاختصارات ومهام سير العمل.
de: Wenn deaktiviert, wird das Skript über Aktionsraster, Trackpad-Gesten, Kurzbefehle und Workflows sofort ausgeführt.
en: Turn this off to run immediately from Action Grid, trackpad gestures, shortcuts, and workflows.
es: Desactívalo para ejecutar inmediatamente desde la Cuadrícula de acciones, los gestos del trackpad, los atajos y los flujos de trabajo.
fr: Désactivez cette option pour exécuter immédiatement depuis la Grille d’actions, les gestes du trackpad, les raccourcis et les workflows.
ja: オフにすると、アクショングリッド、トラックパッドジェスチャ、ショートカット、ワークフローからすぐに実行します。
ko: 끄면 동작 그리드, 트랙패드 제스처, 단축키 및 워크플로에서 즉시 실행합니다.
pt: Desative para executar imediatamente pela Grade de ações, gestos do trackpad, atalhos e fluxos de trabalho.
ru: Отключите, чтобы сразу запускать из Сетки действий, жестов трекпада, сочетаний клавиш и процессов.
tr: Eylem Izgarası, Trackpad hareketleri, kısayollar ve iş akışlarından doğrudan çalıştırmak için kapatın.
zh_hant: 關閉後，從操作網格、觸控板手勢、快捷鍵和工作流程執行時會立即執行。
